IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/CompanyLegalType/CompanyLegalType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CompanyLegalType</name>
 <enumValues>
  <name>Company</name>
 </enumValues>
 <enumValues>
  <name>Individual</name>
 </enumValues>
 <enumValues>
  <name>IndividualCompany</name>
 </enumValues>
 <enumValues>
  <name>NonResident</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Partners/Partners.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Partners</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>Customer</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Employee</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Consignor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgent</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Other</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultCarrier</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Email</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Companies/Forms/ListForm/Module.bsl
#Region FormEventHandlers
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	CatCompaniesServer.OnCreateAtServer(Cancel, StandardProcessing, ThisObject, Parameters);
	ThisObject.List.QueryText = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(ThisObject.List.QueryText);
	CatalogsServer.OnCreateAtServerListForm(ThisObject, List, Cancel, StandardProcessing);
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	If ThisObject.FormOwner <> Undefined And 
		Not DisableAutomaticCreationOfCompanyAndAgreementForPartner() Then
		CompanyCreationQuestion(ThisObject.FormOwner.Object.Ref);
	Endif;	
EndProcedure

#EndRegion

#Region COMMANDS

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	SelectedRows = Items.List.SelectedRows;
	ExternalCommandsClient.GeneratedListChoiceFormCommandActionByName(SelectedRows, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name, SelectedRows);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName, SelectedRows) Export
	ExternalCommandsServer.GeneratedListChoiceFormCommandActionByName(SelectedRows, ThisObject, CommandName);
EndProcedure

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, List, Items.List.SelectedRows);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, List, Items.List.SelectedRows);
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure OurCompanyFilterOnChange(Item)
	CommonFunctionsClientServer.SetFilterItem(List.Filter.Items, "OurCompany", ?(OurCompanyFilter = 1, True, False),
		DataCompositionComparisonType.Equal, ValueIsFilled(OurCompanyFilter));
EndProcedure

// Company creation question.
// 
// Parameters:
//  PartnerRef - CatalogRef.Partners
&AtClient
Procedure CompanyCreationQuestion(PartnerRef)
	
	AskQuestion = False;
	If ValueIsFilled(PartnerRef) And
	 TypeOf(PartnerRef) = Type("CatalogRef.Partners") And
	 Not PartnerHasCompanies(PartnerRef) And
	 PartnerTypeMustHaveCompany(PartnerRef) Then
	 	AskQuestion = True;
	EndIf; 	
  	
  	If Not AskQuestion Then
  		Return;
  	EndIf;	
  	
  	TextQuestion = R().QuestionToUser_032;
	AdditionalParameters = New Structure;
	AdditionalParameters.Insert("Partner", PartnerRef);
	CallbackDescription = New CallbackDescription("CompanyCreationQuestionAfter", ThisObject, AdditionalParameters);
	ShowQueryBox(CallbackDescription, TextQuestion, QuestionDialogMode.YesNo);
			
EndProcedure

// Company creation question after.
// 
// Parameters:
//  QuestionResult - DialogReturnCode
//  AdditionalParameters - Structure
&AtClient
Procedure CompanyCreationQuestionAfter(QuestionResult, AdditionalParameters) Export
	If QuestionResult <> DialogReturnCode.Yes Then
		Return;
	EndIf;	
		
	CreateCompanyForPartner(AdditionalParameters.Partner);
	Items.List.Refresh();			 
		
EndProcedure

// Create company for partner.
// 
// Parameters:
//  PartnerRef - CatalogRef.Partners
&AtServer
Procedure CreateCompanyForPartner(PartnerRef)
	CompanyObject = Catalogs.Companies.CreateItem();
	FillPropertyValues(CompanyObject, PartnerRef, "Description_en, Description_ru, Description_tr, TaxID");
	CompanyObject.Type = Enums.CompanyLegalType.Company;
	CompanyObject.Partner = PartnerRef;
	CompanyObject.Write();
EndProcedure

// Partner has companies.
// 
// Parameters:
//  PartnerRef - CatalogRef.Partners
// 
// Returns:
//  Boolean - Partner has companies
&AtServerNoContext
Function PartnerHasCompanies(PartnerRef)
	CompaniesArray = Catalogs.Partners.GetCompaniesForPartner(PartnerRef);	
	PartnerHasCompanies = False;
	If CompaniesArray.Count() > 0 Then
		PartnerHasCompanies = True;
	EndIf;	 
	Return PartnerHasCompanies;	
	
EndFunction	

// Partner type must have company.
// 
// Parameters:
//  PartnerRef - CatalogRef.Partners
// 
// Returns:
//  Boolean - Partner type must have company
&AtServerNoContext
Function PartnerTypeMustHaveCompany(PartnerRef)
	
	AttributesStructure = CommonFunctionsServer.GetAttributesFromRef(PartnerRef, "Customer, Vendor, Consignor, Other");
	PartnerTypeMustHaveCompany = (AttributesStructure.Customer Or
									AttributesStructure.Vendor Or
									AttributesStructure.Consignor Or
									AttributesStructure.Other);
	Return PartnerTypeMustHaveCompany;
EndFunction

&AtServer
Function DisableAutomaticCreationOfCompanyAndAgreementForPartner()
	Return UserSettingsServer.AllCatalogs_AdditionalSettings_DisableAutomaticCreationOfCompanyAndAgreementForPartner(SessionParameters.CurrentUser);
EndFunction			

#EndRegion
